---
type: InsulationTypeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# InsulationTypeSet

`Autodesk.Revit.DB.Electrical.InsulationTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | InsulationTypeSet | — | `public InsulationTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( InsulationType item )` |
| Method | Erase | — | `public virtual int Erase ( InsulationType item )` |
| Method | ForwardIterator | — | `public virtual InsulationTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( InsulationType item )` |
| Method | ReverseIterator | — | `public virtual InsulationTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |